{
    "definitions": {
        "care/harm": "Intuitions about avoiding emotional and physical damage to another individual.",
        "fairness/cheating": "Intuitions about equal treatment and fair outcomes for individuals.",
        "loyalty/betrayal": "Intuitions about cooperating with ingroups and defending them from betrayal.",
        "authority/subversion": "Intuitions about deference to legitimate authority and respect for traditions.",
        "sanctity/degradation": "Intuitions about avoiding bodily and spiritual contamination and degradation.",
        "liberty/oppression": "Intuitions about resistance to domination and valuing personal autonomy.",    
        "care-harm": "Intuitions about avoiding emotional and physical damage to another individual.",
        "fairness-cheating": "Intuitions about equal treatment and fair outcomes for individuals.",
        "loyalty-betrayal": "Intuitions about cooperating with ingroups and defending them from betrayal.",
        "authority-subversion": "Intuitions about deference to legitimate authority and respect for traditions.",
        "sanctity-degradation": "Intuitions about avoiding bodily and spiritual contamination and degradation.",
        "liberty-oppression": "Intuitions about resistance to domination and valuing personal autonomy.", 
        "caring": "Showing concern and nurturing for others’ well-being.",
        "kindness": "Acting with consideration and benevolence toward others.",
        "compassion": "Sympathetic concern for the suffering of others.",
        "gentleness": "Mild and tender behavior toward others.",
        "fairness": "Treating others justly and without bias.",        
        "reciprocity": "Responding to actions of others with equivalent actions.",
        "trustworthiness": "Being reliable and worthy of trust.",
        "equality": "Ensuring similar treatment and rights for all.",
        "loyalty": "Allegiance to one's group or community.",
        "patriotism": "Love and support for one’s country.",
        "self-sacrifice": "Willingness to give up one’s own interest for others.",
        "group allegiance": "Commitment to the welfare of one's group.",
        "obedience": "Compliance with authority and rules.",
        "respect": "Recognition of others’ status and experience.",
        "deference": "Yielding to the judgment or opinion of others.",       
        "purity": "Avoidance of moral or physical contamination.",
        "chastity": "Abstinence from immoral sexual behavior.",
        "temperance": "Moderation and self-control.",
        "piety": "Religious devotion and reverence.",
        "cleanliness": "Maintaining hygiene and ritual purity.",
        "autonomy": "Acting according to one's own values and desires.",
        "freedom": "Absence of coercion and oppression.",
        "resistance": "Opposition to domination and control.",
        "rebellion": "Act of defying authority or norms.",

        "fidelity": "The moral obligation to honor one's promises, tell the truth, and uphold commitments made to others. If you make a promise, you have a prima facie obligation to uphold it.",
        "reparation": "The moral obligation to make amends for harms or wrongs one has committed, whether intentional or accidental. If you offend someone, you have the moral obligation to make it right.",
        "gratitude": "The moral obligation to express appreciation and reciprocate kindnesses received from others. If you have benefited from someone, you have the moral obligation to show appreciation.",
        "justice": "The moral obligation to ensure fair treatment and to distribute goods, benefits, and burdens in proportion to merit. You have a moral obligation to distribute goods equally.",
        "beneficence": "The moral obligation to actively promote the well-being and happiness of others. You have a moral obligation to help your brother/sister.",
        "self-improvement": "The moral obligation to improve one’s own character, knowledge, and moral virtues. You are morally obliged to improve your personality.",
        "non-maleficence": "The moral obligation to avoid causing harm or injury—physically, emotionally, or morally—to others. You are morally obliged not to disappoint your brother or sister.",
    
        "growth": "Motivated by intrinsic goals, openness, and expansion.",
        "self-protection": "Motivated by security, safety, and avoiding threats.",
        "self-transcendence": "Enhancement of others and transcendence of selfish interests.",
        "self-enhancement": "Social superiority and esteem.",
        "openness to change": "Intrinsic interest in novelty and mastery and a desire for affectively pleasant arousal.",
        "conservation": "Subordination of self in favor of socially imposed expectations and protection of order and harmony in relations.",
        "benevolence": "Preservation and enhancement of the welfare of people with whom one is in frequent personal contact.",
        "universalism": "Understanding, appreciation, tolerance, and protection for the welfare of all people and of nature.",
        "self-direction": "Independent thought and action, choosing, creating, and exploring.",
        "stimulation": "Excitement, novelty, and challenge in life.",
        "hedonism": "Pleasure and sensuous gratification for oneself.",
        "achievement": "Personal success through demonstrating competence according to social standards.",
        "power": "Control or dominance over people and resources.",
        "conformity": "The restraint of actions, inclinations, and impulses that are likely to upset or harm others and violate social expectations or norms.",
        "tradition": "Respect, commitment, and acceptance of the customs and ideas that traditional culture or religion provides.",
        "security": "Safety, harmony, and stability of society, relationships, and self.",
        "benevolence:dependability": "Being a reliable and trustworthy member of the in-group.",
        "benevolence:caring": "Devotion to the welfare of in-group members.",
        "universalism:tolerance": "Acceptance and understanding of those who are different from oneself.",
        "universalism:concern": "Commitment to equality, justice, and protection for all people.",
        "universalism:nature": "Preservation of the natural environment.",
        "conformity:interpersonal": "Avoidance of upsetting or harming other people.",
        "conformity:rules": "Compliance with rules, laws, and formal obligations.",
        "security:societal": "Safety and stability in the wider society.",
        "security:personal": "Safety in one’s immediate environment.",
        "power:resources": "Power through control of material and social resources.",
        "power:dominance": "Power through exercising control over people.",
        "self-direction:action": "The freedom to determine one’s own actions.",
        "self-direction:thought": "The freedom to cultivate one’s own ideas and abilities.",    
        "face": "Security and power through maintaining one’s public image and avoiding humiliation.",
        "humility": "Recognizing one’s insignificance in the larger scheme of things.",

        "human_rights": "Universal entitlements inherent to all human beings, categorized into three historical generations reflecting liberty, equality, and solidarity.",
        "first_generation": "Rights focused on individual liberty and protection from state interference; associated with the idea of 'Liberté'.",
        "civil_rights": "Rights that protect individuals’ personal freedoms and physical integrity.",
        "political_rights": "Rights that allow individuals to participate in the political life of society and in democratic governance.",
        "right_to_life": "Every individual has the inherent right to life, protected by law (UDHR Art. 3).",
        "freedom_from_torture": "No one shall be subjected to torture or cruel, inhuman or degrading treatment (UDHR Art. 5).",
        "freedom_from_slavery": "No one shall be held in slavery or servitude (UDHR Art. 4).",
        "right_to_privacy": "Everyone has the right to protection against arbitrary interference with their privacy, family, home, or correspondence (UDHR Art. 12).",
        "freedom_of_thought_conscience_religion": "Everyone has the right to freedom of thought, conscience, and religion, including the right to change religion or belief (UDHR Art. 18).",
        "equality_before_law": "All are equal before the law and are entitled without discrimination to equal protection (UDHR Art. 7).",
        "freedom_of_expression": "Everyone has the right to freedom of opinion and expression (UDHR Art. 19).",
        "freedom_of_assembly": "Everyone has the right to peaceful assembly and association (UDHR Art. 20).",
        "freedom_of_association": "Everyone has the right to form and join associations (UDHR Art. 20).",
        "right_to_vote": "Everyone has the right to take part in government through free and fair elections (UDHR Art. 21).",
        "right_to_fair_trial": "Everyone is entitled to a fair and public hearing by an independent tribunal (UDHR Art. 10).",
        "right_to_seek_asylum": "Everyone has the right to seek asylum from persecution in other countries (UDHR Art. 14).",
    
        "second_generation": "Rights related to material equality and access to essential social services; associated with the idea of 'Égalité'.",
        "economic_rights": "Rights guaranteeing fair access to productive resources and economic security.",
        "right_to_work": "Everyone has the right to work and to free choice of employment (UDHR Art. 23).",
        "right_to_fair_wages": "Everyone who works has the right to just and favorable remuneration (UDHR Art. 23.3).",
        "right_to_unionize": "Everyone has the right to form and join trade unions (UDHR Art. 23.4).",
        "protection_against_unemployment": "Everyone has the right to protection against unemployment (UDHR Art. 23.1).",
        "social_rights": "Rights ensuring basic social protection and well-being.",
        "right_to_social_security": "Everyone has the right to social security (UDHR Art. 22).",
        "right_to_health": "Everyone has the right to a standard of living adequate for health and well-being (UDHR Art. 25).",
        "right_to_housing": "Part of the right to an adequate standard of living (UDHR Art. 25).",
        "right_to_adequate_standard_of_living": "Everyone has the right to a standard of living adequate for health and well-being (UDHR Art. 25.1).",
        "cultural_rights": "Rights allowing participation in cultural life and protection of intellectual property.",
        "right_to_education": "Everyone has the right to free elementary education and access to higher education (UDHR Art. 26).",
        "right_to_participate_in_cultural_life": "Everyone has the right freely to participate in the cultural life of the community (UDHR Art. 27).",
        "right_to_protection_of_scientific_and_artistic_production": "Everyone has the right to the protection of the moral and material interests resulting from scientific, literary or artistic production (UDHR Art. 27.2).",
    
        "third_generation": "Collective or group rights addressing transnational, environmental, and humanitarian concerns; associated with 'Fraternité'.",
        "national_solidarity_rights": "Rights rooted in self-determination and shared development across nations and peoples.",
        "self_determination": "Right of peoples to determine their political status and pursue their economic, social, and cultural development (ICCPR & ICESCR Common Art. 1).",
        "development": "Right to equitable development with respect for sovereignty and social justice (UN Declaration on the Right to Development, 1986).",
        "common_heritage": "Right of humanity to benefit from shared natural and cultural resources (UNESCO, UN Outer Space Treaty).",
        "social_group_solidarity_rights": "Rights addressing shared global challenges and interdependence among peoples.",
        "group_solidarity_rights": "Rights addressing shared global challenges and interdependence among peoples.",
        "peace": "Right of peoples to live in peace and security, free from war and aggression (UNGA Res. 39/11, 1984).",
        "environment": "Right to a clean, healthy, and sustainable environment (Stockholm Declaration 1972; UNHRC Res. 48/13).",
        "humanitarian_assistance": "Right to receive aid in situations of natural disaster or conflict (UNGA Res. 46/182, 1991).",
        "emerging_right_to_democracy": "Proposed right ensuring access to democratic governance and public participation (UN Human Rights Committee General Comment 25)."
    
    }
}